mysqldump: [Warning] Using a password on the command line interface can be insecure.
-- MySQL dump 10.13  Distrib 8.4.7, for Linux (x86_64)
--
-- Host: localhost    Database: etc
-- ------------------------------------------------------
-- Server version	8.4.7

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8mb4 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Dumping data for table `checkpoint`
--

LOCK TABLES `checkpoint` WRITE;
/*!40000 ALTER TABLE `checkpoint` DISABLE KEYS */;
INSERT INTO `checkpoint` VALUES (1,'寰愬窞甯?,'CP001','2025-12-20 18:15:14.000000','鍙屽悜','鐫㈠畞鍘?,4,33.985100,117.942300,'鑻忕殩鐣?(104鐪侀亾)','姹熻嫃鐪?,'鑻忕殩鐣?(104鐪侀亾)',1,'鐪佺晫鍗″彛'),(2,'寰愬窞甯?,'CP002','2025-12-20 18:15:14.000000','鍙屽悜','閾滃北鍖?,4,34.187200,117.183400,'鑻忕殩鐣?(311鍥介亾)','姹熻嫃鐪?,'鑻忕殩鐣?(311鍥介亾)',1,'鐪佺晫鍗″彛'),(3,'寰愬窞甯?,'CP003','2025-12-20 18:15:14.000000','鍙屽悜','閾滃北鍖?,4,34.053400,117.082300,'鑻忕殩鐣?(寰愭槑楂橀€?','姹熻嫃鐪?,'鑻忕殩鐣?(寰愭槑楂橀€?',1,'鐪佺晫鍗″彛'),(4,'寰愬窞甯?,'CP004','2025-12-20 18:15:14.000000','鍙屽悜','鐫㈠畞鍘?,4,33.892300,117.823400,'鑻忕殩鐣?(瀹挎柊楂橀€?','姹熻嫃鐪?,'鑻忕殩鐣?(瀹挎柊楂橀€?',1,'鐪佺晫鍗″彛'),(5,'寰愬窞甯?,'CP005','2025-12-20 18:15:14.000000','鍙屽悜','娌涘幙',4,34.723400,116.931200,'鑻忕殩鐣?(寰愭樊楂橀€?','姹熻嫃鐪?,'鑻忕殩鐣?(寰愭樊楂橀€?',1,'鐪佺晫鍗″彛'),(6,'寰愬窞甯?,'CP006','2025-12-20 18:15:14.000000','鍙屽悜','鏂版矀甯?,4,34.384500,118.354200,'鑻忕殩鐣?(鏂版壃楂橀€?','姹熻嫃鐪?,'鑻忕殩鐣?(鏂版壃楂橀€?',1,'鐪佺晫鍗″彛'),(7,'寰愬窞甯?,'CP007','2025-12-20 18:15:14.000000','鍙屽悜','娌涘幙',4,34.812300,116.873400,'鑻忛瞾鐣?(206鍥介亾)','姹熻嫃鐪?,'鑻忛瞾鐣?(206鍥介亾)',1,'鐪佺晫鍗″彛'),(8,'寰愬窞甯?,'CP008','2025-12-20 18:15:14.000000','鍙屽悜','閭冲窞甯?,4,34.523400,118.012300,'鑻忛瞾鐣?(104鍥介亾)','姹熻嫃鐪?,'鑻忛瞾鐣?(104鍥介亾)',1,'鐪佺晫鍗″彛'),(9,'寰愬窞甯?,'CP009','2025-12-20 18:15:14.000000','鍙屽悜','璐炬豹鍖?,4,34.451200,117.452300,'鑻忛瞾鐣?(浜彴楂橀€?','姹熻嫃鐪?,'鑻忛瞾鐣?(浜彴楂橀€?',1,'鐪佺晫鍗″彛'),(10,'寰愬窞甯?,'CP010','2025-12-20 18:15:14.000000','鍙屽悜','閭冲窞甯?,4,34.612300,117.953400,'鑻忛瞾鐣?(鏋ｅ簞杩炴帴绾?','姹熻嫃鐪?,'鑻忛瞾鐣?(鏋ｅ簞杩炴帴绾?',1,'鐪佺晫鍗″彛'),(11,'寰愬窞甯?,'CP011','2025-12-20 18:15:14.000000','鍙屽悜','閭冲窞甯?,4,34.583400,118.123400,'鑻忛瞾鐣?(浜勃楂橀€?','姹熻嫃鐪?,'鑻忛瞾鐣?(浜勃楂橀€?',1,'鐪佺晫鍗″彛'),(12,'寰愬窞甯?,'CP012','2025-12-20 18:15:14.000000','鍙屽悜','鏂版矀甯?,4,34.423400,118.412300,'鑻忛瞾鐣?(娌傛渤璺?','姹熻嫃鐪?,'鑻忛瞾鐣?(娌傛渤璺?',1,'鐪佺晫鍗″彛'),(13,'寰愬窞甯?,'CP013','2025-12-20 18:15:14.000000','鍙屽悜','閭冲窞甯?,4,34.312300,118.523400,'杩炰簯娓晫1(寰愯繛楂橀€?','姹熻嫃鐪?,'杩炰簯娓晫1(寰愯繛楂橀€?',1,'鐪佺晫鍗″彛'),(14,'寰愬窞甯?,'CP014','2025-12-20 18:15:14.000000','鍙屽悜','閭冲窞甯?,4,34.283400,118.483400,'杩炰簯娓晫2(310鍥介亾)','姹熻嫃鐪?,'杩炰簯娓晫2(310鍥介亾)',1,'鐪佺晫鍗″彛'),(15,'寰愬窞甯?,'CP015','2025-12-20 18:15:14.000000','鍙屽悜','閾滃北鍖?,4,34.012300,117.323400,'瀹胯縼鐣?(寰愬楂橀€?','姹熻嫃鐪?,'瀹胯縼鐣?(寰愬楂橀€?',1,'鐪佺晫鍗″彛'),(16,'寰愬窞甯?,'CP016','2025-12-20 18:15:14.000000','鍙屽悜','閾滃北鍖?,4,33.983400,117.253400,'瀹胯縼鐣?(寰愬蹇€?','姹熻嫃鐪?,'瀹胯縼鐣?(寰愬蹇€?',1,'鐪佺晫鍗″彛'),(17,'寰愬窞甯?,'CP017','2025-12-20 18:15:14.000000','鍙屽悜','鐫㈠畞鍘?,4,33.853400,117.723400,'瀹胯縼鐣?(104鍥介亾)','姹熻嫃鐪?,'瀹胯縼鐣?(104鍥介亾)',1,'鐪佺晫鍗″彛'),(18,'寰愬窞甯?,'CP018','2025-12-20 18:15:14.000000','鍙屽悜','鐫㈠畞鍘?,4,33.823400,117.893400,'瀹胯縼鐣?(鏂版壃楂橀€?','姹熻嫃鐪?,'瀹胯縼鐣?(鏂版壃楂橀€?',1,'鐪佺晫鍗″彛'),(19,'寰愬窞甯?,'CP019','2025-12-20 18:15:14.000000','鍙屽悜','鐫㈠畞鍘?,4,33.783400,118.023400,'瀹胯縼鐣?(寰愮洂楂橀€?','姹熻嫃鐪?,'瀹胯縼鐣?(寰愮洂楂橀€?',1,'鐪佺晫鍗″彛');
/*!40000 ALTER TABLE `checkpoint` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2025-12-20 20:35:53
